<?php

/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

/**
 * 
 *
 * @author Administrator
 */
class Tvar {
	public static $gameClientType = array(
		'网页'=>'网页游戏 ',
		'客户端'=>'客户端游戏',
		'手机'=>'手机游戏',
		'电玩'=>'电玩',
		'小游戏 '=>'小游戏 ',
	);
	public static $system = array(
		'PC端'=>'PC端',
		'安卓'=>'安卓 ',
		'苹果'=>'苹果 ',
		'WP'=>'WP',
		'塞班'=>'塞班',
		'塞班'=>'塞班 ',
	);
	public static $gameType = array(
		'角色扮演',
		'战阵策略',
		'模拟经营',
		'益智休闲',
		'运动竞技',
		'其他类型',
	);
	public static $gameTheme = array(
		'音乐'=>'音乐 ',
		'武侠'=>'武侠 ',
		'科幻'=>'科幻 ',
		'三国'=>'三国 ',
		'西游'=>'西游 ',
		'战争'=>'战争 ',
		'魔幻'=>'魔幻  ',
		'动漫'=>'动漫  ',
		'历史'=>'历史  ',
		'射击'=>'射击  ',
		'体育'=>'体育  ',
		'棋牌'=>'棋牌  ',
		'竞速'=>'竞速  ',
		'商业'=>'商业  ',
		'儿童'=>'儿童  ',
		'格斗'=>'格斗',
		'修真'=>'修真   ',
		'航海'=>'航海',
		'玄幻'=>'玄幻 ',
		'玄幻'=>'仙侠',
		'其他'=>'其他',
	);
	
	public static $gameRelative = array(
		'角色扮演',
		'战阵策略',
		'模拟经营',
		'益智休闲',
		'运动竞技',
		'其他类型',
	);
	
	public static $gameCharge = array(
		'时间收费',
		'道具收费',
		'限时免费',
	);
	public static $gameUl = array(
		'2D'=>'2D',
		'2.5D'=>'2.5D',
		'3D'=>'3D',
		'横版'=>'横版',
		'其他'=>'其他',
	);
	public static $gameFightform = array(
		'即时'=>'即时',
		'回合'=>'回合',
		'战棋'=>'战棋',
		'文字'=>'文字',
		'半即时'=>'半即时',
		'卡牌'=>'卡牌',
		'自动'=>'自动',
		'其他'=>'其他',
	);
	public static $gameGstate = array(
		'立项',
		'demo',
		'测试',
		'已上线',
		
	);
	public static $gameChargingMode = array(
		'道具收费'=>'道具收费',
		'时长收费'=>'时长收费',
		'下载收费'=>'下载收费',
		'完全免费'=>'完全免费',
	);
	
	public static $nominate = array(
		"否",
		"是",
	);
	
	public static $nomi_font = array(
		'全天'=>'全天',
		'通宵'=>'通宵',
		'9'=> '9',
		'10'=>'10',
		'11'=>'11',
		'12'=>'12',
		'13'=>'13',
		'14'=>'14',
		'15'=>'15',
		'16'=>'16',
		'17'=>'17',
		'18'=>'18',
		'19'=>'19',
		'20'=>'20',
		'21'=>'21',
	);
	public static $day_refer = array(
//		'0000-0001-0002-0003-0004-0005-0006-0007-0008-0009-0010-0011-0012-0013-0014-0015-0016-0017-0018-0019-0020-0021-0022-0023',
//		'0000-0001-0002-0003-0004-0005-0006-0007-0023',
            '0-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23',
            '0-1-2-3-4-5-6-7-23',
	);
	
}

?>
